E2EClient/xml_template/POH/04_base_create_2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://webservice" xmlns:m1="java:xml_soapadapter">
  <soapenv:Body>
<m:assetComponent xmlns:m="http://webservice">
<m:AssetComponentIN>
        <m1:OrganizationCode>500</m1:OrganizationCode>
        <m1:CustomerCode>SW_CUST_AUTO_XXXX</m1:CustomerCode>
        <m1:BillingAccountId>SW_ACCT_AUTO_XXXX</m1:BillingAccountId>
        <m1:Product>
          <m1:SOId>1</m1:SOId>
          <m1:RootInstanceId>SW_ROOTINST_AUTO_XXXX</m1:RootInstanceId>
          <m1:ParentInstanceId>SW_ROOTINST_AUTO_XXXX</m1:ParentInstanceId>
          <m1:ProductInstanceId>SW_PRODINST_AUTO_XXXX</m1:ProductInstanceId>
          <m1:ActionCode>Add</m1:ActionCode>
          <m1:ActionType>100</m1:ActionType>
          <m1:LineNumber>2</m1:LineNumber>
          <m1:ProductCatalogId>4121</m1:ProductCatalogId>       
          <m1:ServiceId />
          <m1:TariffId>SW_BASE_TARIFF_XXXX</m1:TariffId>
          <m1:StartDate>SW_PVT_XXX</m1:StartDate>
          <m1:ModifyDate />
          <m1:EndDate></m1:EndDate>
	 	  <m1:DisconnectionDate />
          <m1:OrderTotal>0</m1:OrderTotal>
          <m1:OrderCurrency>EUR</m1:OrderCurrency>
          <m1:DisconnectionRequested />
          <m1:BillingCharged>N</m1:BillingCharged>
          <m1:OrderChannel>Dealer Portal</m1:OrderChannel>
          <m1:OrderTypeCode>Add New Service</m1:OrderTypeCode>
          <m1:OrderSubTypeCode />
          <m1:OrderReason />
          <m1:UserBillingID />
          <m1:ListOfAttributes>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>LogisticOperator</m1:Name>
              <m1:Value>MD</m1:Value>
            </m1:Attribute>
           <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Entry Ticket</m1:Name>
              <m1:Value>SW_ENTRYFEE_XXX</m1:Value>
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Entry Ticket IVA inclusa</m1:Name>
              <m1:Value>SW_ENTRYFEEIVA_XXX</m1:Value>
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Flag Vendita One Shot</m1:Name>
              <m1:Value>N</m1:Value>
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Importo</m1:Name>
              <m1:Value>SW_IMPORTOFEE_XXX</m1:Value>
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Importo IVA inclusa</m1:Name>
              <m1:Value>SW_IMPORTOFEEIVA_XXX</m1:Value>
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Numero Rate</m1:Name>
              <m1:Value>SW_NUMERO_XXX</m1:Value>
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Override Entry Ticket</m1:Name>
              <m1:Value />
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Override Importo</m1:Name>
              <m1:Value />
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Override Numero Rate</m1:Name>
              <m1:Value />
            </m1:Attribute>
            <m1:Attribute>
              <m1:ActionCode>Add</m1:ActionCode>
              <m1:Name>Tipologia SIM</m1:Name>
              <m1:Value></m1:Value>
            </m1:Attribute>
          </m1:ListOfAttributes>
        </m1:Product>
</m:AssetComponentIN>
</m:assetComponent>
 </soapenv:Body>
</soapenv:Envelope>